src/src/Catalogs/CounterpartyContracts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>CounterpartyContracts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Counterparties</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsInStandardUnits</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractNo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ContractType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SupplierPriceTypes</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SupplierPriceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LinesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContractTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyBankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyContractStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityEndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProvideEPD</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VariantsOfProvidingEPD</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EditableParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>InfobaseParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Parameter</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
								<v8:Type>cfg:EnumRef.ContractsWithCounterpartiesTemplatesParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>StagesOfPayment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Term</Name>
							<Type>
								<v8:Type>cfg:EnumRef.PaymentTerm</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DuePeriod</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentPercentage</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EarlyPaymentDiscounts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Enums/ContractType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ContractType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WithVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithAgent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesArApAdjustments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesArApAdjustments</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ArApAdjustments</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAssignment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAdjustment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DebtAssignmentToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VendorDebtAdjustment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesSalesOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesSalesOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForSale</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ObsoleteWorkOrder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPurchaseOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPurchaseOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesCashReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesCashReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncomeEarningAccounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPaymentReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPaymentReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesGoodsReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesGoodsReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PurchaseFromSupplier</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceiptFromAThirdParty</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromAThirdParty</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesGoodsReturn.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesGoodsReturn</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToSupplier</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/CounterpartyContracts/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Function returns the list of the "key" attributes names.
//
Function GetObjectAttributesBeingLocked() Export
	
	Result = New Array;
	Result.Add("Owner");
	Result.Add("SettlementsCurrency");
	
	Return Result;
	
EndFunction

// Receives the counterparty contract by default according to the filter conditions. Default or the only contract
// returns or an empty reference.
//
// Parameters
//  Counterparty	-	<CatalogRef.Counterparty> 
// 						counterparty, contract of which
//  is	needed	to 
// 						get Company - <CatalogRef.Companies> Company,
//  contract	of	which is needed to get ContractKindsList - <Array> 
// 						or <ValuesList> consisting values of the type <EnumRef.ContractType> Desired contract kinds
//
// Returns:
//   <CatalogRef.CounterpartyContracts> - found contract or empty ref
//
Function GetDefaultContractByCompanyContractKind(Counterparty, Company, ContractKindsList = Undefined) Export
	
	CounterpartyMainContract = Counterparty.ContractByDefault;
	
	If ContractKindsList = Undefined
		OR (ContractKindsList.FindByValue(CounterpartyMainContract.ContractKind) <> Undefined
		AND CounterpartyMainContract.Company = Company) Then
		
		Return CounterpartyMainContract;
	EndIf;
	
	Query = New Query;
	QueryText = 
	"SELECT ALLOWED
	|	CounterpartyContracts.Ref
	|FROM
	|	Catalog.CounterpartyContracts AS CounterpartyContracts
	|WHERE
	|	CounterpartyContracts.Owner = &Counterparty
	|	AND CounterpartyContracts.Company = &Company
	|	AND CounterpartyContracts.DeletionMark = FALSE"
	+?(ContractKindsList <> Undefined,"
	|	And CounterpartyContracts.ContractKind IN (&ContractKindsList)","");
	
	Query.SetParameter("Counterparty", Counterparty);
	Query.SetParameter("Company", Company);
	Query.SetParameter("ContractKindsList", ContractKindsList);
	
	Query.Text = QueryText;
	Result = Query.Execute();
	
	If Result.IsEmpty() Then
		Return Catalogs.CounterpartyContracts.EmptyRef();
	EndIf;
	
	Selection = Result.Select();
	
	Selection.Next();
	Return Selection.Ref;

EndFunction

// Checks the counterparty contract on the map to passed parameters.
//
// Parameters
// MessageText - <String> - error message
// about	errors	Contract - <CatalogRef.CounterpartyContracts> - checked
// contract	Company	- <CatalogRef.Company> - company
// document	Counterparty	- <CatalogRef.Counterparty> - document
// counterparty	ContractKindsList	- <ValuesList> consisting values of the type <EnumRef.ContractType>. 
// 						Desired contract kinds.
//
// Returns:
// <Boolean> -True if checking is completed successfully.
//
Function ContractMeetsDocumentTerms(MessageText, Contract, Company, Counterparty, ContractKindsList) Export
	
	MessageText = "";
	
	If Not Counterparty.DoOperationsByContracts Then
		Return True;
	EndIf;
	
	DoesNotMatchCompany = False;
	DoesNotMatchContractKind = False;
	
	If Contract.Company <> Company Then
		DoesNotMatchCompany = True;
	EndIf;
		
	If ContractKindsList.FindByValue(Contract.ContractKind) = Undefined Then
		DoesNotMatchContractKind = True;
	EndIf;
	
	If (DoesNotMatchCompany OR DoesNotMatchContractKind) = False Then
		Return True;
	EndIf;
	
	MessageText = NStr("en = 'The following contract fields do not match the document fields:'");
	
	If DoesNotMatchCompany Then
		MessageText = MessageText + "
									|- " + NStr("en = 'Company'");
	EndIf;
	
	If DoesNotMatchContractKind Then
		MessageText = MessageText + "
									|- " + NStr("en = 'Counterparty role'");
	EndIf;
	
	Return False;
	
EndFunction

// Returns a list of available contract kinds for the document.
//
// Parameters
// Document  - any document providing counterparty
// contract OperationKind  - document operation kind.
//
// Returns:
// <ValuesList>   - list of contract kinds which are available for the document.
//
Function GetContractKindsListForDocument(Document, OperationKind = Undefined, TabularSectionName = "") Export
	
	ContractKindsList = New ValueList;
	
	If TypeOf(Document) = Type("DocumentRef.OpeningBalanceEntry") Then
		
		If TabularSectionName = "AccountsPayable" Then
			
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
			
		ElsIf TabularSectionName = "AccountsReceivable" Then
			
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.ArApAdjustments") Then
		
		If TabularSectionName = "Debitor" Then
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
		ElsIf TabularSectionName = "Creditor" Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		Else
			If OperationKind = Enums.OperationTypesArApAdjustments.CustomerDebtAssignment Then
				ContractKindsList.Add(Enums.ContractType.WithCustomer);
				ContractKindsList.Add(Enums.ContractType.WithAgent);
			Else
				ContractKindsList.Add(Enums.ContractType.WithVendor);
				ContractKindsList.Add(Enums.ContractType.FromPrincipal);
			EndIf;
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.LetterOfAuthority") Then
		
		ContractKindsList.Add(Enums.ContractType.WithVendor);
		ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.AdditionalExpenses") Then
		
		ContractKindsList.Add(Enums.ContractType.WithVendor);
		ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SalesOrder") Then
		
		If OperationKind = Enums.OperationTypesSalesOrder.OrderForSale Then
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
		Else
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.WorkOrder") Then
		
		ContractKindsList.Add(Enums.ContractType.WithCustomer);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.PurchaseOrder") Then
		
		If OperationKind = Enums.OperationTypesPurchaseOrder.OrderForPurchase Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractType.WithVendor);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.AccountSalesFromConsignee") Then
		
		ContractKindsList.Add(Enums.ContractType.WithAgent);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.AccountSalesToConsignor") Then
		
		ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SubcontractorReportIssued") Then
		
		ContractKindsList.Add(Enums.ContractType.WithCustomer);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SubcontractorReport") Then
		
		ContractKindsList.Add(Enums.ContractType.WithVendor);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CashReceipt") 
		OR TypeOf(Document) = Type("DocumentRef.PaymentReceipt") Then
		
		If OperationKind = Enums.OperationTypesCashReceipt.FromVendor
			OR OperationKind = Enums.OperationTypesPaymentReceipt.FromVendor Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SupplierInvoice") Then
		
		ContractKindsList.Add(Enums.ContractType.WithVendor);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.GoodsReceipt") Then
		
		If OperationKind = Enums.OperationTypesGoodsReceipt.PurchaseFromSupplier Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
		Else
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CashVoucher")
		OR TypeOf(Document) = Type("DocumentRef.PaymentExpense") Then
		
		If OperationKind = Enums.OperationTypesCashVoucher.Vendor 
			OR OperationKind = Enums.OperationTypesPaymentExpense.Vendor Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
			ContractKindsList.Add(Enums.ContractType.WithAgent);
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SalesInvoice")
		OR TypeOf(Document) = Type("DocumentRef.GoodsIssue") Then
		ContractKindsList.Add(Enums.ContractType.WithCustomer);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.GoodsIssue") Then

		If OperationKind = Enums.OperationTypesGoodsIssue.ReturnToAThirdParty Then
			ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		ElsIf OperationKind = Enums.OperationTypesGoodsIssue.TransferToAThirdParty Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
			ContractKindsList.Add(Enums.ContractType.WithAgent)
		Else
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.Quote") Then
		
		ContractKindsList.Add(Enums.ContractType.WithCustomer);
		ContractKindsList.Add(Enums.ContractType.WithAgent);
		ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SupplierQuote") Then
		
		ContractKindsList.Add(Enums.ContractType.WithVendor);
		ContractKindsList.Add(Enums.ContractType.WithAgent);
		ContractKindsList.Add(Enums.ContractType.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CreditNote") Then
		ContractKindsList.Add(Enums.ContractType.WithCustomer);
	ElsIf TypeOf(Document) = Type("DocumentRef.DebitNote") Then
		ContractKindsList.Add(Enums.ContractType.WithVendor);
	ElsIf TypeOf(Document) = Type("DocumentRef.GoodsReturn") Then
		
		If OperationKind = Enums.OperationTypesGoodsReturn.FromCustomer Then
			ContractKindsList.Add(Enums.ContractType.WithCustomer);
		ElsIf OperationKind = Enums.OperationTypesGoodsReturn.ToSupplier Then
			ContractKindsList.Add(Enums.ContractType.WithVendor);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CustomsDeclaration") Then
		
		ContractKindsList.Add(Enums.ContractType.Other);
		
	EndIf;
	
	Return ContractKindsList;
	
EndFunction

#Region PrintInterface

// Fills in Sales order printing commands list
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	// Contract
	PrintCommand = PrintCommands.Add();
	PrintCommand.Handler		= "DriveClient.PrintCounterpartyContract";
	PrintCommand.ID				= "ContractForm";
	PrintCommand.Presentation	= NStr("en = 'Contract form'");
	PrintCommand.FormsList		= "ItemForm, ListForm, ChoiceForm, ChoiceFormWithCounterparty";
	PrintCommand.Order			= 1;
	
EndProcedure

#EndRegion

#EndIf
